menu = '''\nВыберите действие:
    1. Добавить заметку
    2. Удалить заметку
    3. Редактировать заметку
    4. Просмотреть заметки
    5. Сохранить заметки в файл
    6. Отобразить список файлов
    7. Открыть базу заметок из файла
    0. Выход\n'''

choice = 'Выбор: '

input_choice = 'Выберите пункт меню: '

delete_note = 'Заметка удалена:'

create_note = 'Заметка создана:'

edited_note = 'Заметка отредактирована:'

empty_list = 'Список заметок пуст!'

all_list = 'Список всех заметок: '

note_find = 'Не найдено заметки с id: '

exception_in = 'Ошибка создания экземпляра класса Notes!'

exception_file_format = 'Неподдерживаемый формат файла: '

note_not_created = 'Заметка не создана!'

note_not_edited = 'Заметка не изменена!'

note_not_deleted = 'Заметка не удалена!'

confirm_delete = 'Вы действительно хотите удалить заметку с id {}? (y/n): '

invalid_choice = 'Некорректный выбор. Попробуйте еще раз.'

file_not_found1 = 'Файл '
file_not_found2 = 'не найден'

input_id = 'Введите id заметки: '

input_title = 'Введите заголовок заметки: '

input_text = 'Введите текст заметки: '

filter_notes = 'Фильтрация заметок. Введите id, заголовок или текст (Enter, что бы отобразить все): '

new_values = 'Введите новые значения (Enter, чтобы оставить прежние): '

saving_to_a_file = '\nСохранение заметок в файл:'

file_ext = 'Формат файла (csv, json, both): '

file_ext_enum = f"csv , json, both"

unknown_file_format = f"Неизвестный формат файла: {file_ext}"

successfully_saved = 'Заметки успешно сохранены в файл.'

file_name = 'Введите название файла заметок (без расширения): '

file_added_successfully = 'Файл успешно прочитан и добавлен в общие заметки'